Repository: OmegaT-L10N/es
Catalog: tm/Gnome localization/en-es.tmx
Source language: en
Languages: es

source: _Monitor Events
es: _Monitor de eventos

source: Start
es: Inicio

source: End
es: Final

source: Too many selectable children
es: Demasiados hijos seleccionables

source: Quick Select
es: Selección rápida

source: Plugin with various methods of selecting accessibles quickly.
es: Complemento con varios métodos para seleccionar accesibles rápidamente.

source: Inspect last focused accessible
es: Inspeccionar el último accesible que tuvo el foco

source: Inspect accessible under mouse
es: Inspeccionar el accesible bajo el ratón

source: Native
es: Nativo

source: Script Type
es: Tipo de script

source: Script Recorder
es: Script grabador

source: Creates dogtail style scripts
es: Crea scripts de estilo para Dogtail

source: The current script will be lost.
es: Se perderá el script actual.

source: Confirm clear
es: Confirme la limpieza

source: Sche_ma:
es: Esque_ma:

source: focusable %s has table interface, no selection interface
es: la interfaz de la tabla %s que puede tener el foco no tiene interfaz de selecciónbutton has focused state without focusable state

source: Full name
es: Nombre completo

source: Key binding
es: Atajo de teclado

source: Content type
es: Tipo de contenido

source: Accerciser Manual v0.2.0
es: Manual de Accerciser v0.2.0

source: Accerciser team
es: Equipo de Accerciser

source: This manual describes version 0.1.5 of Accerciser.
es: Este manual describe la versión 0.1.5 de Accerciser.

source: This manual describes the use of Accerciser.
es: Este manual describe el uso de Accerciser.

source: To report a bug or make a suggestion regarding the Accerciser application or this manual, follow the directions in the GNOME Feedback Page.
es: Para informar de un fallo, o hacer alguna sugerencia concerniente a la aplicación Accerciser o este manual, siga las indicaciones en la Página de comentarios de GNOME.

source: Accerciser is an interactive Python accessibility explorer for the GNOME desktop. It uses AT-SPI to inspect and control widgets, allowing you to check if an application is providing correct information to assistive technologies and automated test frameworks. Accerciser has a simple plugin framework which you can use to create custom views of accessibility information.
es: Accerciser es un explorador de accesibilidad interactivo escrito en Python para el escritorio GNOME. Usa AT-SPI para inspeccionar y controlar los widgets, permitiéndole comprobar si una aplicación está proporcionando la información correcta a las tecnologías de asistencia y entornos de trabajo de prueba automáticos. Accerciser tiene un entorno de complementos simple que puede usar para crear sus vistas personalizadas de la información de accesibilidad.

source: In essence, Accerciser is a next generation at-poke tool.
es: En esencia, Accerciser es la siguiente generación de la herramienta at-poke.

source: To Start Accerciser
es: Para iniciar Accerciser

source: You can start Accerciser in the following ways:
es: Puede iniciar Accerciser de las siguientes formas:

source: Applications menu
es: Menú Aplicaciones

source: Choose the ProgrammingAccerciser menu item.
es: Elija el elemento del menú ProgramaciónAccerciser.

source: Command line
es: Línea de comandos

source: Type the following command in a console window then press Return:
es: Escriba el siguiente comando en una ventana de consola y después pulse Retorno:

source: When You Start Accerciser
es: Al iniciar Accerciser

source: When you start Accerciser, the following window is displayed.
es: Se mostrará la siguiente ventana cuando inicie Accerciser.

source: Accerciser Main Window
es: Ventana principal de Accerciser

source: Shows main window. Contains title bar, menu bar, accessible tree , right plugin display area, and bottom plugin display area. The menu bar contains File, Edit, Bookmarks, View, and Help menus.
es: Muestra la ventana principal de . Contiene la barra de título, la barra de menú, el árbol accesible, el área izquierda de visualización de complemento y el área inferior de visualización de complemento. La barra de menú contiene los menús de Archivo, Editar, Ver y Ayuda.

source: The main Accerciser window contains the following elements:
es: La ventana principal de Accerciser contiene los siguientes elementos:

source: Menubar
es: Barra de menú

source: The menu bar contains commands for managing plugins, managing and using bookmarks, refreshing the accessible tree view, and accessing this help system.
es: La barra de menú contiene comandos para gestionar los complementos, gestionar y usar los marcadores, refrescar la vista de árbol accesible y acceder a este sistema de ayuda.

source: Accessible tree view
es: Vista de árbol accesible

source: The accessible tree view allows to view all of the accessibles starting at the desktop level. Selecting an accessible makes it available for further inspection using the loaded plugins.
es: La vista de árbol accesible le permite ver todos los accesibles, comenzando por el nivel del escritorio. Seleccionar un accesible lo hace disponible para futuras inspecciones usando los complementos cargados.

source: Right plugin view
es: Vista derecha de complemento

source: This is one of the two default plugin views. When Accerciser is first run, most plugins will reside here. You can drag plugin tabs to the bottom plugin view or to the desktop to show two or more plugins simultaneously.
es: Esta es una de las dos vistas de complemento predeterminadas. Cuando Accerciser se ejecuta por primera vez, la mayoría de los complementos residirán aquí. Puede arrastrar las solapas de complementos a la vista inferior de complemento o al escritorio para mostrar dos o más complementos simultaneamente.

source: Bottom plugin view
es: Vista inferior de complemento

source: You can drag plugins to or from this area just like the right plugin view.
es: Puede arrastrar complementos a o desde esta área igual que en la vista derecha de complemento.

source: Plugin View Management
es: Gestión de la vista de complementos

source: Accerciser has two modes for viewing plugins. The current view mode could be toggled with ViewSingle plugin view or by pressing Controlt. When single mode is enabled, all plugins will be put in the top right plugin view and ordered alphabetically, this could be useful for screen reader users who have no use for Accerciser's flexible plugin spacial layout scheme. When single view mode is disabled plugin tabs could be dragged and dropped in to different plugin views, or could be dragged to the desktop to put the given plugin in a new view. The placement of plugins could also be manipulated with the plugin context menu that could be brought up either from the plugin tab, or the plugin preferences dialog.
es: Accerciser tiene dos modelos para ver complementos. El modo de vista actual se puede conmutar pulsando VerVista individual de complementos o pulsando Controlt. Cuando el modo individual está activado, todos los complementos se pondrán en la vista de complemento superior derecha ordenados alfabéticamente, útil para los usuarios de lectores de pantalla que no pueden usar el flexible esquema espacial de mostrado de complementos de Accerciser. Cuando la vista individual de complemento está desactivada se pueden arrastrar y soltar solapas de complementos en las diferentes vistas de complementos, o se pueden arrastrar al escritorio para mostrar el complemento dado en una nueva vista. También se puede manipular el emplazamiento de los complementos con el menú contextual del complemento que puede aparecer tanto de la solapa del complemento como del diálogo de preferencias del mismo.

source: Usage
es: Uso

source: You can use Accerciser to inspect any accessible widget shown in the tree view using the available plugins. The first step is to select an accessible to inspect using one of the following methods:
es: Puede usar Accerciser para inspeccionar cualquier widget accesible mostrado en la vista de árbol usando los complementos disponibles. El primer paso es seleccionar un accesible a inspeccionar usando uno de los siguientes métodos:

source: Select an accessible through the tree view.
es: Seleccione un accesible a través de la ventana de árbol.

source: Use the tree view to navigate the hierarchy of accessible objects rooted at desktop. Unfolding a tree node reveals its immediate children while folding it hides them. Each node shows an icon for its associated application or widget role and its accessible name, if available. The second column lists how many nodes will be shown if the item is unfolded.
es: Use la vista en árbol para navegar por la jerarquía de objetos accesibles originarios del escritorio. Desplegar un nodo del árbol revela sus hijos inmediatos mientras que plegarlo los oculta. Cada nodo muestra un icono para su aplicación asociada o el rol del widget y, si está disponible, su nombre accesible. La segunda columna lista el número de nodos que se mostrarán si el elemento de despliega.

source: Using bookmarks
es: Uso de los marcadores

source: Accerciser allows bookmarking selected accessibles for later examining. This could be helpful if the target application must be restarted, for example after rebuilding it. To bookmark the currently selected accessible do BookmarksAdd Bookmark... or press Controld.
es: Accerciser permite marcar los accesibles seleccionados para examinarlos posteriormente. Esto puede ser útil si la aplicación objetivo debe reiniciarse, por ejemplo, después de reconstruirla. Para marcar el accesible seleccionado actualmente pulse MarcadoresAñadir marcador... o pulse Controld.

source: Bookmarks to accessibles in Accerciser are defined by an application name and a "path" in the application's internal accessible hierarchy to the bookmarked accessible. When the target application is in a different state (ie. multiple top level frames) the path might not be correct.
es: Los marcadores a accesibles en Accerciser están definidos por el nombre de la aplicación y una «ruta» en la jerarquía interna del accesible de la aplicación al accesible marcado. Cuando la aplicación objetivo está en un estado diferente (ej. múltiples marcos de nivel superior) puede que la ruta no sea correcta.

source: Bookmarks could be managed by accessing the bookmark editing dialog through BookmarksEdit Bookmarks....
es: Los marcadores se pueden gestionar accediendo al diálogo de edición de marcadores a través de MarcadoresEditar marcadores....

source: Default Plugins
es: Complementos predeterminados

source: Accerciser comes with several default plugins. These plugins allow you to view a variety of information about the currently selected accessible in the tree view and its neighbors. The default plugins available in 0.1.5 are the following:
es: Accerciser viene con varios complementos predeterminados. Estos complementos le permiten ver una variedad de información acerca del accesible actualmente seleccionado en la vista de árbol y sus vecinos. Los complementos predeterminados disponibles en la versión 0.1.5 son los siguientes:

source: This plugin displays information about the available interfaces for the selected tree view accessible. Unsupported interfaces are grayed out. Various instruments for viewing and controlling an interface are available under each expander.
es: Este complemento muestra información acerca de los interfaces disponibles para el accesible de vista de árbol seleccionado. Los interfaces no soportados se sombrean. Bajo cada expansor hay disponibles varios instrumentos para ver y controlar un interfaz.

source: Interfaces that are supported by the selected accessible are shown as sensitive.
es: Los interfaces que están soportados por el accesible seleccionado se mostrarán como sensitivos.

source: This plugin monitors the selected types of events from the selected tree view accessible, from the selected tree view application, or the entire desktop.
es: Este complemento monitoriza los tipos de eventos seleccionados desde la vista en árbol accesible, desde la aplicación de vista en árbol o de todo el escritorio.

source: The bottom part of the event monitor window allows you to pick the type and source of events.
es: La parte inferior de la ventana del monitor de eventos le permite seleccionar el tipo y la fuente de los eventos.

source: By pressing ControlAltl anywhere on the desktop, the last logged event will be highlighted for later reference. See for how to change this key combination.
es: Presionando ControlAltl en cualquier parte del escritorio, se resaltará el último evento registrado para una referencia posterior. Consulte la para saber cómo cambiar esta combinación de teclas.

source: This plugin is a fully-fledged IPython console. Press Tab to show completions for the current command. Press Enter to execute any valid Python code. Commands at the console have access to the currently selected accessible in the accessible tree by way of the acc variable. In addition, all functions and constants from the pyatspi package are available as locals in the console. The most important of these are the functions for querying to other accessibility interfaces. For example, to query to the Text interface: t = acc.queryText() . Imports from the current working directory or Python path are also allowed.
es: Este complemento es una consola IPythin completa. Pulse Tab para mostrar completo el comando actual. Pulse Retorno para ejecutar cualquier código Python válido. Los comandos en la consola tienen acceso al accesible actualmente seleccionado en el árbol accesible a través de la variable acc. Además, todas las funciones y constantes del paquete pyatspi están disponibles, como locales, en la consola. Lo más importante de esto son las funciones para consultar otros interfaces de accesibilidad. Por ejemplo, para consultar el interfaz de texto: t = acc.queryText() . También se permite importar desde el directorio de trabajo actual o desde ruta Python.

source: This plugin shows the interfaces, methods, and attributes supported by the accessible selected in the tree view.
es: Este complemento muestra las interfaces, métodos y atributos soportados por el accesible seleccionado en la vista de árbol.

source: The API browser.
es: El examinador API.

source: Script recorder
es: Script grabador

source: Accerciser's script recorder allows users to record keyboard interaction with other desktop applications for the purpose of authoring UI test scripts. Currently the plug-in supports the generation of scripts for three platforms: Dogtail, LDTP, and an Accerciser's built-in API. Once you press the "Record" button every keyboard interaction will be recorded in to a script that could be executed later as a stand alone script.
es: El script grabador de Accerciser permite a los usuarios grabar la interacción del teclado con otras aplicaciones del escritorio para autorizar los scripts de prueba para el IU. Actualmente el complemento soporta la generación de scripts para tres plataformas: Dogtail, LDTP y el API integrado de Accerciser. Una vez que pulse el botón «Grabar» se grabará toda interacción de teclado en un script que podrá ser ejecutado más tarde, como un script individual.

source: The script recorder.
es: Es script grabador.

source: Quick select
es: Selección rápida

source: This plugin provides global hotkeys for allowing quick selection of accessibles through the target application's UI. Pressing ControlAlta will select the last focused widget's accessible in Accerciser. Pressing ControlAltt will select the accessible of the widget that is under the pointer.
es: Este complemento proporciona combinaciones de teclas globales para permitir una rápida selección de los accesibles a través del IU de la aplicación objetivo. Al pulsar ControlAlta se seleccionará el accesible del widget que tuvo el foco por última vez en Accerciser. Al pulsar ControlAltt se seleccionará el accesible del widget que está bajo el puntero.

source: Validation
es: Validación

source: This plugin checks applications for accessibility problems and generates a report including the severity and description of the problems. The report links errors to documentation about how to remedy common problems. The plugin is extensible with test schemas that define rules for validation.
es: Este complemento comprueba los problemas de accesibilidad de las aplicaciones y genera un informe incluyendo la gravedad y la descripción de los problemas. El informe enlaza los errores con la documentación acerca de cómo solucionar los problemas comunes. El complemento es extensible con esquemas de prueba que definen reglas de validación.

source: To run the validator, first select an item in the accessibility tree. The plugin will test the selected accessible and all of its descendants. Next select a schema to use for the test. Then click the Validate button to start the test. While the test is running, click the button again to cancel it.
es: Para ejecutar el validador, seleccione un elemento en el árbol de accesibilidad. El complemento comprobará el accesible seleccionado y todos sus descendientes. Después seleccione un esquema que usar para la comprobación. A continuación pulse el botón Validar para iniciar la comprobación. Pulse de nuevo el botón mientras se está ejecutando la comprobación para cancelarla.

source: When the test completes, the report table shows the severity and description of all errors. Double click a row in the table to show the associated accessible in the tree. With an item selected, click the Help to get information about how to resolve the problem.
es: La tabla de informe mostrará la gravedad y descripción de todos los errores cuando termine la comprobación. Pulse dos veces sobre una fila de la tabla para mostrar el accesible asociado en el árbol. Con un elemento seleccionado, pulse el botón Ayuda para obtener información acerca de cómo resolver el problema.

source: Preferences
es: Preferencias

source: There are some elements in Accerciser that are configurable:
es: Hay algunos elementos en Accerciser que son configurables:

source: Plugin Layout
es: Disposición de complementos

source: There are two methods for configuring plugin layout in Accerciser. First you may choose EditPreferences to activate the Preferences dialog. This dialog contains tabs for each section, select the Plugins tab. Under this section you will find a list view of all the available plugins. Right-click on any of the plugins listed to configure it's view.
es: Hay dos métodos para configurar la disposición de los complementos en Accerciser. Primeramente, debe elegir EditarPreferencias para activar el diálogo Preferencias. Éste diálogo contiene solapas para cada sección, seleccione la solapa Complementos. Bajo esta sección encontrará una lista de todos los complementos disponibles. Pulse con el botón derecho del ratón sobre cualquiera de los complementos listados para configurar su vista.

source: You may bypass the Preferences dialog by using drag and drop to move plugin tabs. Dragging a plugin tab to the bottom or right plugin area in the main window will move the plugin. Dragging a tab to the desktop will create a new plugin window and drop the plugin in it.
es: Puede querer evitar el diálogo Preferencias usando arrastrar y soltar para mover las solapas de los complementos. Arrastrar una solapa de un complemento a la parte inferior o derecha del área de los complementos en la ventana principal, moverá el complemento. Arrastrar una solapa al escritorio creará una nueva ventana de complemento y soltará el complemento en ella.

source: Global Hotkey Configuration
es: Configuración global de teclas rápidas

source: Some elements in Accerciser may enable certain functionality via hotkeys. The hotkey combination could be changed via the Preferences dialog, to do so you may select EditPreferences to activate the Preferences dialog. This dialog contains tabs for each section, select the Global Hotkeys tab. Under this section you will find a list view of all the available hotkey features. Change the key bindings to you liking.
es: Algunos elementos en Accerciser pueden activar cierta funcionalidad a través de las teclas rápidas. La combinación de teclas rápidas puede cambiarse a través del diálogo Preferencias, para hacerlo debe seleccionar EditarPreferencias para activar el menú Preferencias. Éste diálogo contiene solapas para cada sección, seleccione la solapa Teclas rápidas globales. Bajo esta sección encontrará una lista de todas las teclas rápidas disponibles. Cambie la combinación de teclas a su gusto.

source: About Accerciser
es: Acerca de Accerciser

source: Accerciser was written by Eitan Isaacson (eitan@ascender.com). To find more information about Accerciser, please visit the Accerciser GNOME Live! page.
es: Eitan Isaacson (eitan@ascender.com) escribió Accerciser. Para obtener más información acerca de Accerciser, visite la página de Accerciseren GNOME Live!.

source: To report a bug or make a suggestion regarding this application or this manual, follow the directions in this document.
es: Para informar de un fallo, o hacer alguna sugerencia concerniente a esta aplicación o este manual, siga las indicaciones en este documento.

source: Redistribution and use in source and binary forms, with or without modification, are permitted under the terms of the BSD License.
es: Se permiten la redistribución y uso en formas binaria y fuentes, con o sin modificación bajo los términos de la licencia BSD.

source: translator-credits
es: Jorge González <jorgegonz\@svn\.gnome\.org>, 2007-2010

source: The default plugin layout for the bottom panel
es: El esquema de complemento predeterminado para el panel inferior

source: The default plugin layout for the top panel
es: El esquema de complemento predeterminado para el panel superior

source: The duration of the highlight box when selecting accessible nodes
es: La duración de la caja resaltada al seleccionar nodos accesibles

source: Select All
es: Seleccionar todas

source: Investigating selected items with the IPython Console Plugin
es: Investigar elementos seleccionados con el complemento de la consola IPython

source: The IPython Console Plugin lets you investigate methods, constants, and properties related to a selected item in the Application Tree View.
es: El complemento de la consola IPython le permite investigar métodos, constantes y propiedades relativas a un elemento seleccionado en la vista en árbol de la aplicación.

source: Typing help(acc) in the IPython Console Plugin shows some useful documentation about the corresponding selected accessible item.
es: Escribir help(acc) en el complemento de la consola de IPython muestra cierta documentación útil sobre el correspondiente elemento accesible seleccionado._

source: external ref='figures/highlighting.png' md5='a7eeb359d726fecba85b13b92a41b919'
es: external ref='figures/highlighting.png' md5='a7eeb359d726fecba85b13b92a41b919'sort

source: 4. Preferences
es: 4. Preferencias

source: Customizing Accerciser's preferences
es: Personalizar las preferencias de Accerciser

source: Configuring Accerciser
es: Configurar Accerciser

source: To configure plugins, hotkeys, and highlighting, do either ctrl+p or Edit Preferences to open a dialog.
es: Para configurar los complementos, las teclas rápidas y el resaltado, pulse ctrl+p o EditarPreferencias para abrir un diálogo.

source: Accerciser preferences
es: Preferencias de Accerciser

source: Accerciser allows you to configure plugins, global hotkeys, and widget's highlighting.
es: Accerciser le permite configurar los complementos, las teclas rápidas globales y el resaltado de widgets.

source: Configuring plugins
es: Configurar complementos
